Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official NUCLEO-F429ZI.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                          |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |SPI6 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN0 |*TIM2_CH1 *TIM5_CH1                       |          |    |          |           
PA1 , // |RMII_REF_CLK [LAN8742A-CZ-TR_REFCLK0]|    |    |    |     |     |     |     |     |     |      |      |      |      |*IN1 |*TIM2_CH2 *TIM5_CH2                       |          |    |          |           
PA2 , // |RMII_MDIO [LAN8742A-CZ-TR_MDIO]      |    |    |    |     |     |     |     |     |     |      |*TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 *TIM5_CH3             |          |    |          |           
PA3 , // |                                     |    |    |    |     |     |     |     |     |     |      |*RX   |      |      |*IN3 |*TIM2_CH4 *TIM5_CH4 +TIM9_CH2             |          |    |          |           
PA4 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |                                     |    |    |    |*SCK |     |     |     |     |     |      |      |      |      |*IN5 |*TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |                                     |    |    |    |*MISO|     |     |     |     |     |      |      |      |      |*IN6 |*TIM3_CH1 +TIM13_CH1                      |          |    |          |           
PA7 , // |RMII_CRS_DV [LAN8742A-CZ-TR_CRS_DV]  |    |    |    |*MOSI|     |     |     |     |     |      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 *TIM3_CH2 *TIM1_CH1N|          |    |          |           
PA8 , // |USB_SOF [TP1]                        |    |    |*SCL|     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PA9 , // |USB_VBUS                             |    |    |    |     |     |     |     |     |     |*TX   |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PA10, // |USB_ID                               |    |    |    |     |     |     |     |     |     |*RX   |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PA11, // |USB_DM                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |USB_DP                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |TMS                                  |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |TCK                                  |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN8 |*TIM8_CH2N *TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN9 |*TIM3_CH4 *TIM1_CH3N *TIM8_CH3N           |          |    |          |           
PB2 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |                                     |    |    |    |+SCK |     |+SCK |     |     |     |      |      |      |      |     |+TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |                                     |    |    |    |+MISO|     |+MISO|     |     |     |      |      |      |      |     |+TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |                                     |    |    |    |+MOSI|     |+MOSI|     |     |     |      |      |      |      |     |+TIM3_CH2                                 |          |    |          |           
PB6 , // |                                     |*SCL|    |    |     |     |     |     |     |     |+TX   |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PB7 , // |LD2 [Blue]                           |*SDA|    |    |     |     |     |     |     |     |+RX   |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PB8 , // |                                     |+SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM10_CH1 +TIM4_CH3                      |          |*D4 |          |           
PB9 , // |                                     |+SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM11_CH1 +TIM4_CH4                      |          |*D5 |          |           
PB10, // |                                     |    |+SCL|    |     |*SCK |     |     |     |     |      |      |*TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |                                     |    |+SDA|    |     |     |     |     |     |     |      |      |*RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |RMII_TXD1 [LAN8742A-CZ-TR_TXD1]      |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PB14, // |LD3 [Red]                            |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |     |*TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|    |          |           
PB15, // |                                     |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |     |*TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|    |          |           
PC0 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |RMII_MDC [LAN8742A-CZ-TR_MDC]        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |           
PC2 , // |                                     |    |    |    |     |*MISO|     |     |     |     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |                                     |    |    |    |     |*MOSI|     |     |     |     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |RMII_RXD0 [LAN8742A-CZ-TR_RXD0]      |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |RMII_RXD1 [LAN8742A-CZ-TR_RXD1]      |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN15|                                          |          |    |          |           
PC6 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |*TX   |     |*TIM8_CH1 +TIM3_CH1                       |          |*D6 |          |           
PC7 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |*RX   |     |*TIM8_CH2 +TIM3_CH2                       |          |*D7 |          |           
PC8 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH3 +TIM3_CH3                       |          |*D0 |          |           
PC9 , // |                                     |    |    |*SDA|     |     |     |     |     |     |      |      |      |      |     |*TIM8_CH4 +TIM3_CH4                       |          |*D1 |          |           
PC10, // |                                     |    |    |    |     |     |*SCK |     |     |     |      |      |+TX   |      |     |                                          |          |*D2 |          |           
PC11, // |                                     |    |    |    |     |     |*MISO|     |     |     |      |      |+RX   |      |     |                                          |          |*D3 |          |           
PC12, // |                                     |    |    |    |     |     |*MOSI|     |     |     |      |      |      |      |     |                                          |          |*CK |          |           
PC13, // |User Blue Button [B1]                |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |           
PD3 , // |                                     |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD4 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |                                     |    |    |    |     |     |     |     |     |     |      |+TX   |      |      |     |                                          |          |    |          |           
PD6 , // |                                     |    |    |    |     |     |+MOSI|     |     |     |      |+RX   |      |      |     |                                          |          |    |          |           
PD7 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |STLK_RX [STM32F103CBT6_PA3]          |    |    |    |     |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |STLK_TX [STM32F103CBT6_PA2]          |    |    |    |     |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PD13, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PD14, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH3                                 |          |    |          |           
PD15, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM4_CH4                                 |          |    |          |           
PE0 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |                                     |    |    |    |     |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |                                     |    |    |    |     |     |     |*MISO|     |     |      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |                                     |    |    |    |     |     |     |*MOSI|     |     |      |      |      |      |     |*TIM9_CH2                                 |          |    |          |*TRACED3   
PE7 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PE10, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PE12, // |                                     |    |    |    |     |     |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |                                     |    |    |    |     |     |     |+MISO|     |     |      |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PE14, // |                                     |    |    |    |     |     |     |+MOSI|     |     |      |      |      |      |     |*TIM1_CH4                                 |          |    |          |           
PE15, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |                                     |    |*SDA|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |                                     |    |*SCL|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF4 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF5 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF6 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1                                |          |    |          |           
PF7 , // |                                     |    |    |    |     |     |     |     |*SCK |     |      |      |      |      |     |*TIM11_CH1                                |          |    |          |           
PF8 , // |                                     |    |    |    |     |     |     |     |*MISO|     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |                                     |    |    |    |     |     |     |     |*MOSI|     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF11, // |                                     |    |    |    |     |     |     |     |+MOSI|     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |USB_PowerSwitchOn [STMPS2151STR_EN]  |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |USB_OverCurrent [STMPS2151STR_FAULT] |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |+RX   |     |                                          |          |    |          |           
PG10, // |                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |RMII_TX_EN [LAN8742A-CZ-TR_TXEN]     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG12, // |                                     |    |    |    |     |     |     |     |     |*MISO|      |      |      |      |     |                                          |          |    |          |           
PG13, // |RMII_TXD0 [LAN8742A-CZ-TR_TXD0]      |    |    |    |     |     |     |     |     |*SCK |      |      |      |      |     |                                          |          |    |          |           
